In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [4]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure",figsize=(10,6))
PREVIOUS_MAX_ROWS  = pd.options.display.max_rows
pd.options.display.max_rows = 20
pd.options.display.max_columns = 20
pd.options.display.max_colwidth = 80
np.set_printoptions(precision=4,suppress=True)

In [7]:
# Series是一种一维的数组型对象，并且包含了数据标签index,就是说有两个属性:数组元素（array）、数组索引（index）
# 索引不一定用数值型
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.array
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
# 索引不一定用数值型
obj2 = pd.Series([4,7,-5,3],index=["d","b","a","c"])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
obj2["a"]
obj2["d"]=6
# 换索引值
obj2[["c","a","d"]]
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [20]:
obj2[obj2>0]
obj2 * 2
import numpy as np
np.exp(obj2)

d    12
b    14
a   -10
c     6
dtype: int64

In [25]:
"b" in obj2
"e" in obj2
6 in obj2.array
"b" in obj2.index

True

In [27]:
sdata = {"Ohio":35000,"Texas":71000,"Oregon":16000,"Utah":5000}
# 字典Series化
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
# 逆操作
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [31]:
states = ["California","Ohio","Oregon","Texas"]
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [35]:
pd.isna(obj4)
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [37]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [40]:
obj3
obj4
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [42]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [45]:
obj
obj.index = ["Bob","Steve","Jeff","Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [47]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# DataFaram是表示矩阵的数据表，包含已排序的列集合，每一列可以是不同的值类型。
# DataFrame既有行索引，又有列索引，它可以被视为一个共享相同索引的Series的字典。
frame = pd.DataFrame(data)

In [48]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [49]:
# head()方法只会选出头部的5行
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [51]:
# tail是尾部，尾巴的意思，tail()方法就是显示最后5行，和head()方法相对应。
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [53]:
pd.DataFrame(data,columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [55]:
frame2 = pd.DataFrame(data,columns=["year","state","pop","debt"])
frame2
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [64]:
# 取列，通过列名索引和列名属性
frame2["state"]
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [62]:
# 取行，通过loc和iloc
frame2.loc[1]
frame2.iloc[2]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [69]:
frame2["debt"] = 16.5
frame2
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [71]:
val = pd.Series([-1.2,-1.5,-1.7],index = ["two","four","five"])
frame["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [73]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   0.0     True
1  2001    Ohio  1.7   1.0     True
2  2002    Ohio  3.6   2.0     True
3  2001  Nevada  2.4   3.0    False
4  2002  Nevada  2.9   4.0    False
5  2003  Nevada  3.2   5.0    False

In [78]:
# del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [80]:
populations = {"Ohio":{2000:1.5,2001:1.7,2002:3.6},"Nevada":{2001:2.4,2002:2.9}}

In [82]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [84]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [85]:
pd.DataFrame(populations,index=[2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [87]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [90]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [93]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [96]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, 0.0],
       [2001, 'Ohio', 1.7, 1.0],
       [2002, 'Ohio', 3.6, 2.0],
       [2001, 'Nevada', 2.4, 3.0],
       [2002, 'Nevada', 2.9, 4.0],
       [2003, 'Nevada', 3.2, 5.0]], dtype=object)

In [101]:
obj = pd.Series(np.arange(3),index=["a","b","c"])
index = obj.index
index
index[1:]

Index(['b', 'c'], dtype='object')

In [106]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5,-2.5,0],index = labels)
obj2
obj2.index is labels

True

In [111]:
frame3
frame3.columns
"Ohio" in frame3.columns
2003 in frame3.index

False

In [113]:
pd.Index(["foo","foo","bar","bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [115]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=["d","b","a","c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [116]:
obj2 = obj.reindex(["a","b","c","d","e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [121]:
obj3 = pd.Series(["blue","purple","yellow"],index=[0,2,4])
obj3
obj3.reindex(np.arange(6),method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [126]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=["a","c","d"],columns=["Ohio","Texas","California"])
frame
frame2 = frame.reindex(index=["a","b","c","d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [128]:
frame.loc[["a","d","c"],["California","Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [131]:
obj = pd.Series(np.arange(5.),index=["a","b","c","d","e"])
obj
new_obj = obj.drop("c")
new_obj
obj.drop(["d","c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [133]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data.drop(index=["Colorado","Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [139]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [140]:
data.drop("two",axis=1)
data.drop(["two","four"],axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [147]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj
obj["b"]
obj[1]
obj[2:4]
obj[["b","a","d"]]
obj[[1,3]]
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [148]:
obj.loc[["b","a","d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [154]:
obj1 = pd.Series([1,2,3],index=[2,0,1])
obj2 = pd.Series([1,2,3],index=["a","b","c"])
obj1
obj2
obj1[[0,1,2]]
obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [156]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [157]:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [159]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data
data["two"]
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [161]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [163]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [165]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [168]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [170]:
data
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [172]:
data.loc[["Colorado","New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [175]:
data.loc["Colorado",["two","three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [179]:
data.iloc[2]
data.iloc[[2,1]]
data.iloc[2,[3,0,1]]
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [182]:
data.loc[:"Utah","two"]
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [184]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [192]:
ser = pd.Series(np.arange(3.))
ser
ser[-1]   # KeyError: -1

KeyError: -1

In [193]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [194]:
ser2 = pd.Series(np.arange(3.),index=["a","b","c"])
ser2[-1]

2.0

In [195]:
ser.iloc[-1]

2.0

In [196]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [200]:
data.loc[:,"one"]=1
data
data.iloc[2] = 5
data
data.loc[data["four"]>5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [202]:
data.loc[data.three == 5]["three"] = 6

C:\Users\马万\AppData\Local\Temp\ipykernel_23672\867481848.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6

In [203]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [206]:
data.loc[data.three == 5,"three"] = 6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [209]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ["a","c","d","e"])
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1], index=["a", "c", "e", "f", "g"])
s1
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [210]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [217]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),columns = list("bcd"),
                   index = ["Ohio","Texas","Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list("bde"),index = ["Utah","Ohio","Texas","Oregon"])

df1
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [218]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [223]:
df1 = pd.DataFrame({"A":[1,2]})
df2 = pd.DataFrame({"B":[3,4]})
df1
df2
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [227]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))
df2.loc[1,"b"] = np.nan
df1
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [229]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [230]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [232]:
1 /df1
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [233]:
df1.reindex(columns = df2.columns,fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [237]:
arr = np.arange(12.).reshape((3,4))
arr
arr[0]
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [240]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]
frame
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [242]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [246]:
series2 = pd.Series(np.arange(3),index=["b","e","f"])
series2
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [252]:
series3 = frame["d"]
frame
series3
frame.sub(series3,axis = "index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [255]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame
np.abs(frame)

               b         d         e
Utah    0.577087  0.124121  0.302614
Ohio    0.523772  0.000940  1.343810
Texas   0.713544  0.831154  2.370232
Oregon  1.860761  0.860757  0.560145

In [258]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    2.384533
d    0.984879
e    3.714041
dtype: float64

In [261]:
frame.apply(f1,axis = "columns")

Utah      0.879701
Ohio      1.342870
Texas     1.656688
Oregon    2.420906
dtype: float64

In [263]:
def f2(x):
    return pd.Series([x.min(),x.max()],index=["min","max"])

frame.apply(f2)

            b         d         e
min -1.860761 -0.860757 -2.370232
max  0.523772  0.124121  1.343810

In [265]:
def my_format(x):
    return f"{x: 2f}"

frame.applymap(my_format)

                b          d          e
Utah    -0.577087   0.124121   0.302614
Ohio     0.523772   0.000940   1.343810
Texas   -0.713544  -0.831154  -2.370232
Oregon  -1.860761  -0.860757   0.560145

In [266]:
frame["e"].map(my_format)

Utah       0.302614
Ohio       1.343810
Texas     -2.370232
Oregon     0.560145
Name: e, dtype: object

In [268]:
obj = pd.Series(np.arange(4), index=["d","a","b","c"])
obj
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [271]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index=["three","one"],
                    columns=["d","a","b","c"])
frame
frame.sort_index()
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [273]:
frame.sort_index(axis="columns",ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [275]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [279]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [281]:
obj.sort_values(na_position = "first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [286]:
frame = pd.DataFrame({"b":[4,7,-3,2],"a":[0,1,0,1]})
frame
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [288]:
frame.sort_values(["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [290]:
obj = pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [292]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [294]:
obj.rank(ascending = False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [296]:
obj.rank(ascending =False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [299]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [301]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [303]:
obj.index.is_unique

False

In [305]:
obj["a"]

a    0
a    1
dtype: int32

In [307]:
obj["b"]

b    2
b    3
dtype: int32

In [312]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df
df.loc["b"]
df.loc["c"]

0   -0.589488
1    1.581700
2   -0.528735
Name: c, dtype: float64

In [313]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [315]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [317]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [319]:
df.sum(axis="index",skipna=False)
df.sum(axis="columns",skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [321]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [323]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [325]:
df.idxmax()

one    b
two    d
dtype: object

In [327]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [330]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [332]:
obj = pd.Series(["a","a","b","c"] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [333]:
price = pd.read_pickle("examples/yahoo_price.pkl")
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [336]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [338]:
returns["MSFT"].corr(returns["IBM"])

returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [341]:
returns.corr()
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [343]:
returns.corrwith(returns["IBM"])
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [345]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [347]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [351]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [352]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [353]:
pd.value_counts(obj.to_numpy(),sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [355]:
obj
mask = obj.isin(["b","c"])
mask
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [363]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [365]:
data = pd.DataFrame({"Qu1":[1,3,4,3,4],
                     "Qu2":[2,3,1,2,3],
                     "Qu3":[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [366]:
data["Qu1"].value_counts().sort_index()

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [368]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [369]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
dtype: int64

In [370]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS